app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<li class="border-2 p-2">
  <p><%= User.find(comment.author_id).name %>: <%= comment.text %></p>